commands.tex
% Created 2019-05-01 Wed 14:29
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\hypersetup{colorlinks=true,linkcolor=blue}
\author{Richard L. Trotta III}
\date{\today}
\title{Code Commands}
\hypersetup{
 pdfauthor={Richard L. Trotta III},
 pdftitle={Code Commands},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 9.1.14)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Chrome}
\label{sec:orge7c76cb}
\begin{itemize}
\item new tab, C-t
\item open closed tab, C+shift-t
\item reload page, C-r
\item next tabs, C-TAB
\item previous tabs, C+shift-TAB
\item go to search bar, C-l
\item close current tab, C-w
\item open downloads, C-j
\item open history, C-h
\item open link in new tab, C-CLICK
\begin{itemize}
\item Select link with TAB then C-ENTER to open in new tab
\end{itemize}
\item search page, C-f (shift+enter to cycle options)
\item go to previous/next page, M-(left/right arrows)
\end{itemize}
\section{Linux}
\label{sec:orgf6d2068}
\begin{itemize}
\item suspend current activity, C-z
\item reset desktop enviroment, M-F2 r
\item to switch desktop enviroments, logout then select enviroment
\item see all running jobs in terminal, jobs
\item resume suspended activity in foreground, fg \%\# (where \# is job number)
\item resume suspended activity in background, bg \%\# (where \# is job number)
\item kill a job, kill \%\# (where \# is job number)
\item find file in directory, find -name "<filename>"
\item make python or shell script work, chmod u+x <script>
\item run python script, python <script>.py
\item see size of directory, du -h
\item see max size of directory, df -h
\item see size of file, ls -ltrh
\item see path of directories, ls -la
\item see amount of data processes, top -u <username>
\item see last commands, history
\item to uncompress a gzip tar file (.tgz or .tar.gz), tar xzf file.tar.gz
\item to uncompress a bzip2 tar file (.tbz or .tar.bz2) to extract the contents., tar xjf file.tar.bz2
\item to uncompressed tar file (.tar), tar xf file.tar
\item to uncompress tar file (.tar) to another directory, tar xC /var/tmp -f file.tar
\item give anyone permission to edit home directory, chmod o+rw /home/<username> (works for individual directories and files)
\item take away permission to edit home directory, chmod o-rw /home/<username> (works for individual directories and files)
\item to give permission to members of group to read home directory, drwxr-x
\item by default jlab has most secure permissions on home directory, drwx
\item procedures (ie source root version) automatically on login, emacs \textasciitilde{}/.login
\item to check ram usage use the htop program, htop (hit q to quit)
\item rsync
\begin{itemize}
\item basic syntax, rsync options source destination
\item common options\ldots{}
\begin{itemize}
\item verbose (show file sync info), -v
\item copies data recursively, -r
\item archive mode (recursive but also preserves timestamps and permissions), -a
\item compress file data, -z
\item human-readable, -h
\item specify a protocol, -e
\item show progress, -P (or \(--\)progress)
\item sync a <dest> and <source> so that they match (file or directory exists in <dest> but not <source> so we delete the ones in <dest>), \(--\)delete
\end{itemize}
\item sync a single file on a local machine, rsync -zvh <source> <dest>
\item sync a directory on local computer, rsync -avzh <source> <dest>
\item sync files and directory over ssh, rsync -avzhe ssh <root>@<ip>:<source> <dest>
\item specify file specific parameters, below is an example where we include files starting with R and exclude all else
\begin{itemize}
\item rsync -avze ssh \(--\)include 'R*' \(--\)exclude '*' <root>@<ip>:<source> <dest>
\end{itemize}
\item set max file size to be transferred, rsync -avzhe \(--\)max-size='200k' <source> <dest>
\item automatically delete source files after successful transfer, rsync \(--\)remove-source-files <anyoptions> <source> <dest>
\item do a test (dry) run to make sure it works properly, rsync \(--\)dry-run <anyoptions> <source> <dest>
\item set bandwidth limit and transfer file, rsync \(--\)bwlimit=100 -avzhe ssh <source> <dest>
\end{itemize}
\end{itemize}
\section{Emacs}
\label{sec:orgca109b3}
\begin{itemize}
\item undo, C-x u (or simply C-/)
\item redo, C-g C-\_
\item save, C-x C-s
\item Save buffer as different file, C-x C-w
\item Save all open buffers, C-x s
\item Insert another file's content into current one, C-x i
\item exit (no save), C-x C-c
\item load .emacs file, M-x load-file
\item next line, C-n
\item previous line, C-p
\item Move one character forward, C-f
\item Move one word forward, M-f
\item Move one word backward, M-b
\item Move to start of a line, C-a
\item Move to end of a line, C-e
\item Move to start of a sentence, M-a
\item Move to end of a sentence, M-e
\item Move one page down, C-v (pgDn)
\item Move one page up, M-v (pgUp)
\item Move to beginning of file, M-<
\item Move to end of file, M->
\item Jump to the beginning of the current function, M-C-a
\item Jump to the end of the current function, M-C-e
\item Jump to the end of braces, M-C-f
\item Jump to the beginning of braces, M-C-b
\item Mark (highlight) text, C-space (C-@)
\item Select all, C-x h
\item Select paragraph, M-h
\item copy, M-w
\item paste, C-y
\item cut, C-w
\item delete word, M-d or C-BACK
\item delete line, C-k or SHIFT+C-BACK
\item delete sentence, M-k
\item search (forward), C-s (C-s to see next instance)
\item search (backward), C-r (C-r to see next instance)
\item replace word, M-\% (press '!' to replace all)
\item spell check, M-x (type ispell in mini-buffer)
\begin{itemize}
\item a, correct
\item r, replace
\end{itemize}
\item center line, M-o M-s
\item change mode (ie c++, java, etc.), M-x (then type; c-mode, java-mode, etc.)
\item bold, M-o b
\item italic, M-o i
\item underline, M-o u
\item default, M-o d
\item tab, C-q TAB
\item keep indentation, C-j
\item indent multiple lines, C-u <TAB>
\item Find difference between two files, M-x diff (then enter names of files)
\item Switch buffer, C-x b (TAB then type buffer name from list of avaliable)
\item Kill buffer, C-x k  (TAB then type buffer name from list of avaliable)
\item See all open buffers, C-x C-b
\item Open different file in current buffer, C-x C-f
\item Open buffer in new frame, C-x 5 (type in file name)
\item Open split window horizontal, C-x 2
\item Open split window vertical, C-x 3
\item Close all split windows, C-x 1
\item Open newly opened file in main buffer, C-x 0
\item Select next split window, C-x o
\item Clear bufffers not used in a while, M-x clean-buffer-list
\item Switch between buffers more easily, M-x ido-mode (to temporarily disable, C-f)
\item Open terminal in emacs, M-x ansi-term (then hit ENTER)
\begin{itemize}
\item to use limited C-x commands, use C-c <singlecharacter> (e.g. C-c o == C-x o)
\end{itemize}
\item Use mouse in -nw, M-x xterm
\item Update buffer if changes occur, C-x C-v (then hit ENTER)
\item Auto update buffer if changes occur, M-x (then type global-auto-revert-mode)
\item Customize emacs, M-x customize
\item Customize emacs with search, M-x customize-group
\item \textasciitilde{}/.emacs is the file with custom settings
\item See and download packages, M-x list-packages
\item Enter dired (directory) mode, C-x C-f ENTER
\item In dired mode\ldots{}
\begin{itemize}
\item to delete a file\ldots{}
\item d (which marks for deletion)
\item x (deletes marked items)
\item to create a directory, t
\item to create a file, C-x C-f (then save)
\item refresh buffer, g
\item run shell command on file, select file then ! (will be prompted to shell command)
\item to copy files, S-c
\item rename file, S-r
\item to mark files, m (then can run multiple shell commands if you want)
\item to unmark files, u
\item to unmark all files, S-u
\item to mark/unmark inverse files, t
\item mark all directories, -/
\item mark all files, -/ then t
\item search for expression, S-a (go to next with M-,)
\item change sorting of directory, s (will cycle time of edit and alphabetical)
\item make dired editable, C-x C-q
\item to exit, C-c C-c
\item to abort changes, C-c ESC
\item M-\% is usable here
\item Replace across multiple files (in dired mode)
\begin{itemize}
\item mark all files, t
\item start a grep session to mark files, Q
\item accept all changes, !
\end{itemize}
\end{itemize}
\item You can save the current desktop, M-x desktop-save
\item reload one saved in another directory, M-x desktop-change-dir
\item reverts to the desktop previously reloaded, M-x desktop-revert
\item See buffer list, C-x C-b (similar to dired)
\item Search buffer for expression, M-x occur (in buffer list)
\item Make names more distinct with uniqify
\item Use -scratch- to edit files and such, it is erased upon leaving emacs
\item Find a word in any file
\begin{itemize}
\item recersively, M-x rgrep
\item just current directory, M-x lgrep
\end{itemize}
\item Begin macro, C-x (
\item End macro, C-x )
\item Run macro, C-x e
\item Macro editor, C-x C-k e
\item Comment out selected area, M-;
\item Align lines of code, M-x align or M-x align-regexp (then enter what to align, e.g. // to align comments)
\item Page up/down in other buffer, M-pg(Up/Down)
\item Open calender, C-c C-d
\end{itemize}
\subsection{Org Mode}
\label{sec:orgafcc718}
\begin{itemize}
\item Used with emacs to create lists and some other cool features
\item convert document, C-c C-e
\item open links(i.e. left mouse click), C-c C-o
\item move the order of item list, M-(up/down)
\item move indentation, M-(left/right)
\item mark item todo, S-(right)
\item mark item done, S-(left)
\item set deadline to item, C-c C-d
\item tag item, C-c C-c (while cursor on item)
\item collaspe bullet, TAB
\item collaspe/open all bullets, S-TAB
\item bullet on next line, M-ENTER
\item reset org to fix issues, C-u M-x org-reload
\end{itemize}
\section{Batch Job}
\label{sec:org84e31b3}
\begin{itemize}
\item run batchscript, jsub <batchscript>
\item find where files about batch are found (e.g. -.err), ls \textasciitilde{}/.farm\_out/
\item see job info, jobinfo <jobindex\#>
\item cancel job, jkill <jobindex\#>
\item cancel all jobs, jkill 0
\end{itemize}
\section{Python}
\label{sec:orgf55fe75}
\section{GitHub}
\label{sec:org0677580}
\begin{itemize}
\item add name to git, git config \(--\)global user.name '<name>'
\item add email to git, git config \(--\)global user.email '<email>'
\item change editor used for git comments, git config \(--\)global core.editor "emacs"
\item see global configuration, git config \(--\)list \(--\)global
\item clone a remote repo (https) to your local repo, git clone <remoteRepoWebAddress>
\item clone a remote repo (https) to your local repo with desired directory name, git clone <remoteRepoWebAddress> <directoryName>
\item clone one specific branch, git clone \(--\)single-branch \(--\)branch <branchname> <repo>
\item see changes to local repo, git status
\item pull all submodules, git submodule update \(--\)init \(--\)recursive
\item to clone a repo with submodules,
\begin{itemize}
\item check that the repo submodule links in github work
\item git clone <repo with submodules>
\begin{itemize}
\item if only certain branch submodule links work you can clone one specific branch, git clone \(--\)single-branch \(--\)branch <branchname> <repo>
\end{itemize}
\item git submodule update \(--\)init \(--\)recursive
\item if that does not work check .gitmodules to make sure submodule is properly listed. The form should be
\begin{itemize}
\item\relax [submodule "<submodulename>"]
path = <submodulename>
url = "\url{https://github.com/}<username>/<submodulename>"
branch = <branch>
\end{itemize}
\item git submodule update \(--\)recursive \(--\)remote
\begin{itemize}
\item if HEAD detached from commit\ldots{}
\begin{itemize}
\item git branch -a (should see HEAD detached)
\item check if the head is really detached, git symbolic-ref HEAD (should result in \emph{fatal: ref HEAD is not a symbolic ref})
\item git remote update
\item change branch to master, git checkout master
\item git pull
\item git branch -a (HEAD detached should disappear but you won't be able to switch back to other branch)
\item git checkout <originalBranch> (should be fixed)
\item git rebase master
\item git add <any conflicts>
\item git rebase master (should be good then)
\end{itemize}
\end{itemize}
\end{itemize}
\item bring up window to see all commits, gitk
\item see differences from previous version of file, git diff <file>
\item to ignore file from git\ldots{}
\begin{itemize}
\item open .gitignore
\item add file name to this
\item this works for directories as well (add /directory to .gitignore)
\end{itemize}
\item prepare change for commit, git add <file>
\item discard all local commits on this branch, git reset --hard -u
\item pull one file from one branch to another, git checkout <branch-with-file> <file> (run from branch you want file)
\item add all deleted files not tracked yet, git add .
\item remove file from tracked list, git rm \(--\)cached <file>
\item reset modified file to unmerged path (ie no longer ready for commt), git reset HEAD <file> (do a git add after this then, may have to do a few times)
\item discard change from commit, git checkout <file>
\item commit all added items to local repo, git commit -author "Richard-Trotta <trotta@cua.edu>" -m "<some message>"
\item check where remote repo is and name of repo, git remote -v
\item remove all files that are untracked, git clean -f
\item remove tracked/untracked file, git checkout \(--\) <file>
\item how to push local repo to remote repo,
\begin{itemize}
\item git status
\item git add -all (for all changes)
\item git commit (do commit procedure above)
\item git pull origin <branch>
\item git push origin <branch>
\end{itemize}
\item create branch from local repo, git branch <newbranch>
\item delete local branch from local repo, git branch -d <branch> (-D forces)
\item see all branches, git branch -avv
\item change branch, git checkout <differentBranch>
\item if branches of repo aren't showing up, git fetch <repo>
\item go to remote branch version of local repo, git checkout \(--\)track origin/<branch>
\item delete remote branch, git push branch origin 	-delete <branch>
\item specify a new remote repo (ie upstream), git remote add upstream <remoteRepo>
\item set up upstream where push will default, git push -set-upstream origin <branch>
\item block push to a remote repo, git remote set-url -push <remoterepo> <messagereminder>
\item replace remote repo (ie upstream), git remote set-url upstream <URLforRemoteRepo>
\item rename current branch, git branch -m <newbranchname>
\item how to create new branch in local repo and push to remote repo,
\begin{itemize}
\item create new branch on github.com
\item git branch <newbranch>
\item git fetch
\item git checkout <newbranch>
\item git pull origin <newbranch>
\item git push origin <newbranch>
\end{itemize}
\item look at project history, git log -oneline
\item see what is different between repo and open submodule, git diff -cached -submodule
\item when copying a directory (ie submodule) into your main directory and this submodule is already part of a different repo do the following,
\begin{itemize}
\item git submodule status (to see if any submodules heads are not your repo)
\item cd <submodule>
\item git remote -v (to see which repo submodule is in)
\item git remote set-url origin \url{https://github.com/}<username>/<repo> (will point submodule to your repo)
\item git remote -v (you should see origin now assigned to your repo)
\item cd ../<outofsubmodule>
\item git rm -cached <submodule>
\item git status (check to make sure your submodule is untracked)
\item git commit
\item git push
\item git submodule status (your submodule should no longer be on here because it is no longer in your repo, only locally accessible)
\item git add <submodule>
\item git commit
\item git push
\item git submodule status (double check the submodule is properly in your repo now)
\end{itemize}
\item to list the file types taking up the most space in your repository, git lfs migrate info (Note: you need the lfs program)
\item git has a strict 100mb limit so to convert some file types to LFS (i.e. so they can be pushed), git lfs migrate import \(--\)include="<filetype>"
\item check for large files in your local master branch, git lfs migrate info --include-ref=master
\item check for large files in every branch, git lfs migrate info \(--\)everything
\end{itemize}
\end{document}